Revit 2027 API
Rebar.CanUseHookType Method
 Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUseHookType(
	ElementId proposedHookId
)
Public Function CanUseHookType (
	proposedHookId As ElementId
) As Boolean
public:
bool CanUseHookType(
	ElementId^ proposedHookId
)
member CanUseHookType :
        proposedHookId : ElementId -> bool
Parameters
proposedHookId ElementId
 The Id of the RebarHookType
Return Value
Boolean
 Returns true if the id is of a valid RebarHookType for the Rebar element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Also, checks that the Style of the Hook matches that of the Rebar's RebarShape
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace